docs: reorder README and remove screenshots section
